In [14]:
import pandas as pd
df = pd.read_excel('student.xlsx', index_col='학번')
df

     이름    학교  국어점수   수학점수  평균  취미
학번
1번  김자바  자바학교     70    90  80   운동
2번  이자바  자바학교     80    80  80   독서
3번  박자바  자바학교     90   100  95   등산
4번  김캐드  캐드학교     60    70  65  NaN
5번  정캐드  캐드학교     80    80  80  NaN

In [2]:
df.groupby('학교')

In [3]:
df.groupby('학교').get_group('자바학교')

     이름    학교  국어점수   수학점수  평균 취미
학번
1번  김자바  자바학교     70    90  80  운동
2번  이자바  자바학교     80    80  80  독서
3번  박자바  자바학교     90   100  95  등산

In [4]:
df.groupby('학교').mean() #계산가능한 데이터의 평균값

      국어점수   수학점수    평균
학교
자바학교   80.0  90.0  85.0
캐드학교   70.0  75.0  72.5

In [5]:
df.groupby('학교').size()

학교
자바학교    3
캐드학교    2
dtype: int64

In [6]:
df.groupby('학교').size()['자바학교']

3

In [8]:
df.groupby('학교')['평균'].mean()

학교
자바학교    85.0
캐드학교    72.5
Name: 평균, dtype: float64

In [9]:
df.groupby('학교')[['국어점수 ', '수학점수']].mean()

      국어점수   수학점수
학교
자바학교   80.0  90.0
캐드학교   70.0  75.0

In [15]:
df['학년']  = [1,1,2,2,3]
df

     이름    학교  국어점수   수학점수  평균  취미   학년
학번
1번  김자바  자바학교     70    90  80   운동   1
2번  이자바  자바학교     80    80  80   독서   1
3번  박자바  자바학교     90   100  95   등산   2
4번  김캐드  캐드학교     60    70  65  NaN   2
5번  정캐드  캐드학교     80    80  80  NaN   3

In [5]:
df.groupby(['학교', '학년']).mean()

         국어점수    수학점수    평균
학교   학년
자바학교 1    75.0   85.0  80.0
     2    90.0  100.0  95.0
캐드학교 2    60.0   70.0  65.0
     3    80.0   80.0  80.0

In [11]:
df.groupby('학년').mean().sort_values('국어점수 ', ascending=False)

    국어점수   수학점수    평균
학년
3    80.0  80.0  80.0
1    75.0  85.0  80.0
2    75.0  85.0  80.0

In [12]:
df.groupby(['학교', '학년']).sum()

         국어점수   수학점수   평균
학교   학년
자바학교 1     150   170  160
     2      90   100   95
캐드학교 2      60    70   65
     3      80    80   80

In [22]:
#df.columns
df.groupby('학교')['취미 '].count()
df.groupby('학교')[['이름', '취미 ']].count()

      이름  취미
학교
자바학교   3    3
캐드학교   2    0